nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov13n.yaml' will call yolov13.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # Nano
  s: [0.50, 0.50, 1024]   # Small
  l: [1.00, 1.00, 512]    # Large
  x: [1.00, 1.50, 512]    # Extra Large

backbone: #input: N*3*640*640
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0
  - [-1, 1, Conv, [128, 3, 2, 1, 2]]
  - [-1, 2, DSC3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2, 1, 4]]
  - [-1, 2, DSC3k2, [512, False, 0.25]] # 4
  - [-1, 1, DSConv, [512, 3, 2]]
  - [-1, 4, A2C2f, [512, True, 4]] # 6
  - [-1, 1, DSConv, [1024, 3, 2]]
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

head:
  - [8, 2, DSC3k2, [1024, True]]
  - [8, 1, SELayer, [1024]]

  - [-2, 1, Conv, [512, 3, 1]]
  - [-1, 2, DSC3k2, [512, True]]
  - [[6, -1], 1, FullPAD_Tunnel, []]
  - [6, 1, SELayer, [512]]

  - [-2, 1, Conv, [256, 3, 1]]
  - [-1, 2, DSC3k2, [256, True]]
  - [[3, -1], 1, FullPAD_Tunnel, []]
  - [3, 1, SELayer, [256]]

  - [[-1, -5, -9], 1, Detect, [nc]] # Detect(P3, P4, P5)
