nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov13n.yaml' will call yolov13.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # Nano
  s: [0.50, 0.50, 1024]   # Small
  l: [1.00, 1.00, 512]    # Large
  x: [1.00, 1.50, 512]    # Extra Large

backbone: #input: N*3*640*640
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 2, DSC3k2, [64, False, 0.25]]
  - [-1, 1, Conv, [128, 3, 2]] # P2/4
  - [-1, 2, DSC3k2, [128, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # P3/8
  - [-1, 2, DSC3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [512, 1, 1]] # 这是一个独立的适配层，输出只通向HyperACE
  - [-2, 1, DSConv, [512, 3, 2]] # P4/16, 这层的输入是上上层，跳过了上一层的输出
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, DSConv, [1024, 3, 2]] # P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 10

head:
  - [[-5, -3, -1], 2, HyperACE, [512, 8, True, True]]
  - [-1, 1, DownsampleConv, []]
  - [-2, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]

  - [[10, -3], 1, FullPAD_Tunnel, []] # c=1024
  - [[8, -5], 1, FullPAD_Tunnel, []] # c=512
  - [[5, -3], 1, FullPAD_Tunnel, []] # c=256

  - [[10, -6], 1, Concat, []]
  - [-1, 2, DSC3k2, [1024, True]]
  - [[15, -1], 1, FullPAD_Tunnel, []]

  - [-2, 1, Conv, [512, 3, 1]]
  - [-1, 2, DSC3k2, [512, True]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[16, -1], 1, FullPAD_Tunnel, []]

  - [-2, 1, Conv, [256, 3, 1]]
  - [-1, 2, DSC3k2, [256, True]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[17, -1], 1, FullPAD_Tunnel, []]

  - [[-1, -5, -9], 1, Detect, [nc]] # Detect(P3, P4, P5)
