nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov13n.yaml' will call yolov13.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # Nano
  s: [0.50, 0.50, 1024]   # Small
  l: [1.00, 1.00, 512]    # Large
  x: [1.00, 1.50, 512]    # Extra Large

backbone: #v13 -> v3
  # [from, repeats, module, args]
  - [ -1, 1, Conv, [ 32, 3, 1 ] ] # 0
  - [ -1, 1, Conv, [ 64, 3, 2 ] ] # 1-P1/2
  - [ -1, 1, Bottleneck, [ 64 ] ]
  - [ -1, 1, Conv, [ 128, 3, 2 ] ] # 3-P2/4
  - [ -1, 2, Bottleneck, [ 128 ] ]
  - [ -1, 1, Conv, [ 256, 3, 2 ] ] # 5-P3/8
  - [ -1, 8, Bottleneck, [ 256 ] ]
  # 添加 1x1 卷积将 P3/8 的通道从 256 提升至 512，以匹配 v13 head 的需求
  - [-1, 1, Conv, [512, 1, 1]] # 7 (适配后的 P3/8, 512 ch)
  - [ -1, 1, Conv, [ 512, 3, 2 ] ] # 7-P4/16
  - [ -1, 8, Bottleneck, [ 512 ] ]
  - [ -1, 1, Conv, [ 1024, 3, 2 ] ] # 9-P5/32
  - [ -1, 4, Bottleneck, [ 1024 ] ] # 10

head: #DSC3k2 -> Bottleneck
  - [[7, 9, 11], 2, HyperACE, [512, 8, True, True, 0.5, 1, "both"]] # 12
  - [-1, 1, nn.Upsample, [None, 2, "bilinear"]] # 13
  - [12, 1, DownsampleConv, []] # 14

  - [[9, 12], 1, FullPAD_Tunnel, []] # 15
  - [[7, 13], 1, FullPAD_Tunnel, []] # 16
  - [[11, 14], 1, FullPAD_Tunnel, []] # 17

  - [-1, 1, nn.Upsample, [None, 2, "bilinear"]] # 18
  - [[-1, 15], 1, Concat, [1]] # 19 (cat backbone P4)
  - [-1, 2, Bottleneck, [512, True]] # 20
  - [[-1, 12], 1, FullPAD_Tunnel, []] # 21

  - [20, 1, nn.Upsample, [None, 2, "bilinear"]] # 22
  - [[-1, 16], 1, Concat, [1]] # 23 (cat backbone P3)
  - [-1, 2, Bottleneck, [256, True]] # 24
  - [13, 1, Conv, [256, 1, 1]] # 25
  - [[24, 25], 1, FullPAD_Tunnel, []] # 26 (P3/8-small detect output)

  - [-1, 1, Conv, [256, 3, 2]] # 27
  - [[-1, 21], 1, Concat, [1]] # 28 (cat head P4)
  - [-1, 2, Bottleneck, [512, True]] # 29
  - [[-1, 12], 1, FullPAD_Tunnel, []] # 30 (P4/16-medium detect output)

  - [29, 1, Conv, [512, 3, 2]] # 31
  - [[-1, 17], 1, Concat, [1]] # 32 (cat head P5)
  - [-1, 2, Bottleneck, [1024,True]] # 33
  - [[-1, 14], 1, FullPAD_Tunnel, []] # 34 (P5/32-large detect output)

  # Detect(P3, P4, P5)
  - [[26, 30, 34], 1, Detect, [nc]] # 35
