nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov13n.yaml' will call yolov13.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # Nano
  s: [0.50, 0.50, 1024]   # Small
  l: [1.00, 1.00, 512]    # Large
  x: [1.00, 1.50, 512]    # Extra Large

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1-P2/4
  - [-1, 2, DSC3k2,  [256, False, 0.25]] # 2
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 3-P3/8
  - [-1, 2, DSC3k2,  [512, False, 0.25]] # 4 (Original P3/8 output, 512 ch)
  # Add 1x1 Conv to scale P3 from 512ch -> 256ch to match yolov3 head's input requirement
  - [-1, 1, Conv, [256, 1, 1]] # 5 (ADAPTED P3/8 output, 256 ch)
  # Continue yolov13 backbone, 'from' index re-mapped
  # P4/16 block (starts from layer 4, NOT 5)
  - [-2, 1, DSConv,  [512, 3, 2]] # 6 (from layer 4, P4/16)
  - [-1, 4, A2C2f, [512, True, 4]] # 7 (P4/16 output, 512 ch)
  # P5/32 block
  - [-1, 1, DSConv,  [1024, 3, 2]] # 8 (P5/32)
  - [-1, 4, A2C2f, [1024, True, 1]] # 9 (P5/32 output, 1024 ch)

# YOLOv3 head (copied), starts at index 10
# Connections re-mapped:
# - Head starts from P5 (new index 9)
# - P4 Concat: connects to new index 7 (yolov13 P4)
# - P3 Concat: connects to new index 5 (Adapted yolov13 P3)
head: # v13 ->v3
  # P5 processing branch
  - [-1, 1, Bottleneck, [1024, False]] # 10 (from backbone P5 at index 9)
  - [-1, 1, Conv, [512, 1, 1]] # 11
  - [-1, 1, Conv, [1024, 3, 1]] # 12
  - [-1, 1, Conv, [512, 1, 1]] # 13
  - [-1, 1, Conv, [1024, 3, 1]] # 14 (P5/32-large)

  # P4 processing branch
  - [-2, 1, Conv, [256, 1, 1]] # 15 (from layer 13)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 16
  # Original yolov3.yaml was: [[-1, 8], 1, Concat, [1]]
  - [[-1, 7], 1, Concat, [1]] # 17 (cat upsample (16) and backbone P4 (7))
  - [-1, 1, Bottleneck, [512, False]] # 18
  - [-1, 1, Bottleneck, [512, False]] # 19
  - [-1, 1, Conv, [256, 1, 1]] # 20
  - [-1, 1, Conv, [512, 3, 1]] # 21 (P4/16-medium)

  # P3 processing branch
  - [-2, 1, Conv, [128, 1, 1]] # 22 (from layer 20)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 23
  # Original yolov3.yaml was: [[-1, 6], 1, Concat, [1]]
  - [[-1, 5], 1, Concat, [1]] # 24 (cat upsample (23) and backbone P3 (5))
  - [-1, 1, Bottleneck, [256, False]] # 25
  - [-1, 2, Bottleneck, [256, False]] # 26 (P3/8-small)

  # Detect layer
  # Original yolov3.yaml was: [[27, 22, 15], 1, Detect, [nc]]
  - [[26, 21, 14], 1, Detect, [nc]] # 27 Detect(P3_out, P4_out, P5_out)