nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov13n.yaml' will call yolov13.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # Nano
  s: [0.50, 0.50, 1024]   # Small
  l: [1.00, 1.00, 512]    # Large
  x: [1.00, 1.50, 512]    # Extra Large

backbone: #假设输入尺寸为640x640
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0(P1/2, 特征金字塔1层/2倍下采样(stride=2), 特征图尺寸640/2=320)
  - [-1, 1, Conv, [128, 3, 2, 1, 2]] # 1(P2/4, 金字塔2层/4倍下采样, 特征图尺寸320/2=640/4=160)
  - [-1, 2, DSC3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2, 1, 4]] # 3(P3/8, 3层/8倍下采样, 尺寸160/2=640/8=80)
  - [-1, 2, DSC3k2, [512, False, 0.25]] # 4 -> 9,13
  - [-1, 1, DSConv, [512, 3, 2]] # 5(P4/16, 尺寸80/2=40)
  - [-1, 4, A2C2f, [512, True, 4]] # 6 -> 9,12
  - [-1, 1, DSConv, [1024, 3, 2]] # 7(P5/32， 40/2=20)
  - [-1, 4, A2C2f, [1024, True, 1]] # 8 -> 9,14

head: #args中不包含c1, c1由上一层的输出自动决定
  - [[3, 6, 8], 1, GiraffeNeckV2, [[256, 512, 1024], 0.5, 0.5]] #-> [Tensor*3]

  - [-1, 1, ExtractLayer, [0]]
  - [-2, 1, ExtractLayer, [1]]
  - [-3, 1, ExtractLayer, [2]]
  
  - [[-3, -2, -1], 1, Detect, [nc]] # Detect(P3, P4, P5)
