nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov13n.yaml' will call yolov13.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # Nano
  s: [0.50, 0.50, 1024]   # Small
  l: [1.00, 1.00, 512]    # Large
  x: [1.00, 1.50, 512]    # Extra Large

backbone: #input: N*3*640*640
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 2, UIB, [128, 0, 3, True, 1, 3.0]] # 2
  - [-1, 1, UIB, [256, 0, 3, True, 2, 3.0]] # 3-P3/8 Downsample
  - [-1, 2, UIB, [512, 0, 3, True, 1, 3.0]] # 4
  - [-2, 1, UIB, [512, 0, 3, True, 2, 4.0]] # P4/16 Downsample
  - [-1, 4, UIB, [512, 0, 5, True, 1, 4.0]] # (Large Kernel 5x5)
  - [-1, 1, UIB, [1024, 0, 3, True, 2, 4.0]] # P5/32 Downsample
  - [-1, 4, UIB, [1024, 0, 5, True, 1, 4.0]] # 8

head:
  - [[3, 6, 8], 1, GiraffeNeckV2, [[256, 512, 1024], 0.5, 0.5]] #-> [Tensor*3]

  - [-1, 1, ExtractLayer, [0]]
  - [-2, 1, ExtractLayer, [1]]
  - [-3, 1, ExtractLayer, [2]]

  - [[-3, -2, -1], 1, Detect, [nc]] #Detect(P3, P4, P5)
