nc: 80
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # Nano
  s: [0.50, 0.50, 1024]   # Small
  l: [1.00, 1.00, 512]    # Large
  x: [1.00, 1.50, 512]    # Extra Large

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 6, 2, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C3, [128]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C3, [512]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 9, C3, [512]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C3, [1024]]
  - [-1, 1, SPPF, [1024, 5]] # 9

head:
  - [[-6, -4, -1], 2, HyperACE, [512, 8, True, True, 0.5, 1, "both"]] # 10
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [-2, 1, DownsampleConv, []]

  - [[-7, -3], 1, FullPAD_Tunnel, []]
  - [[-10, -3], 1, FullPAD_Tunnel, []]
  - [[-6, -3], 1, FullPAD_Tunnel, []]
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, -4], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [512, True]]
  - [[-1, 10], 1, FullPAD_Tunnel, []]

  - [-2, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [256, True]]
  - [11, 1, Conv, [256, 1, 1]]
  - [[-2, -1], 1, FullPAD_Tunnel, []] #-> Detect
  
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 19], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [512, True]]
  - [[-1, 10], 1, FullPAD_Tunnel, []] #-> Detect

  - [-2, 1, Conv, [512, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [1024, True]]
  - [[-1, 12], 1, FullPAD_Tunnel, []] #-> Detect
  
  - [[-9, -5, -1], 1, Detect, [nc]] # Detect(P3, P4, P5)
