nc: 80
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # Nano
  s: [0.50, 0.50, 1024]   # Small
  l: [1.00, 1.00, 512]    # Large
  x: [1.00, 1.50, 512]    # Extra Large

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0 (P1/2)
  - [-1, 1, Conv, [128, 3, 2, 1, 2]] # (P2/4)
  - [-1, 2, DSC3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2, 1, 4]] # (P3/8)
  - [-1, 2, DSC3k2, [512, False, 0.25]]
  - [-1, 1, DSConv, [512, 3, 2]] # (P4/16)
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, DSConv, [1024, 3, 2]] # (P5/32)
  - [-1, 4, A2C2f, [1024, True, 1]]

head: #args中不包含c1, c1由上一层的输出自动决定
  - [[-5, -3, -1], 2, HyperACE, [512, 8, True, True, 0.5, 1, "both"]] # 9
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [-2, 1, DownsampleConv, []]

  - [[-6, -3], 1, FullPAD_Tunnel, []] # 12
  - [[-9, -3], 1, FullPAD_Tunnel, []]
  - [[-6, -3], 1, FullPAD_Tunnel, []]
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, -4], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [512, True]]
  - [[-1, 9], 1, FullPAD_Tunnel, []]

  - [-2, 1, nn.Upsample, [None, 2, "nearest"]] # 19
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [256, True]]
  - [10, 1, Conv, [256, 1, 1]]
  - [[-2, -1], 1, FullPAD_Tunnel, []] #-> Detect
  
  - [-1, 1, Conv, [256, 3, 2]] # 24
  - [[-1, 18], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [512, True]]
  - [[-1, 9], 1, FullPAD_Tunnel, []] #-> Detect

  - [-2, 1, Conv, [512, 3, 2]] # 28
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [1024, True]]
  - [[-1, 11], 1, FullPAD_Tunnel, []] #-> Detect
  
  - [[-9, -5, -1], 1, Detect, [nc]] # Detect(P3, P4, P5)
