nc: 80
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # Nano
  s: [0.50, 0.50, 1024]   # Small
  l: [1.00, 1.00, 512]    # Large
  x: [1.00, 1.50, 512]    # Extra Large

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [32, 3, 2]] # 0
  - [-1, 1, EffBlock, [64, 2, 4, 0]]
  - [-1, 1, EffBlock, [128, 2, 4, 0]]
  - [-1, 1, EffBlock, [256, 1, 4, 0]]
  - [-1, 4, EffBlock, [512, 1, 4, 1]]
  - [-1, 1, EffBlock, [512, 2, 4, 1]]
  - [-1, 4, EffBlock, [1024, 2, 4, 1]] # 6

head:
  - [[-3, -2, -1], 2, HyperACE, [512, 8, True, True, 0.5, 1, "both"]] # 9
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [-2, 1, DownsampleConv, []]

  - [[-5, -3], 1, FullPAD_Tunnel, []] # 10
  - [[-7, -3], 1, FullPAD_Tunnel, []]
  - [[-6, -3], 1, FullPAD_Tunnel, []]
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, -4], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [512, True]]
  - [[-1, 7], 1, FullPAD_Tunnel, []]

  - [-2, 1, nn.Upsample, [None, 2, "nearest"]] # 19
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [256, True]]
  - [8, 1, Conv, [256, 1, 1]]
  - [[-2, -1], 1, FullPAD_Tunnel, []] #-> Detect
  
  - [-1, 1, Conv, [256, 3, 2]] # 24
  - [[-1, 16], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [512, True]]
  - [[-1, 7], 1, FullPAD_Tunnel, []] #-> Detect

  - [-2, 1, Conv, [512, 3, 2]] # 28
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 2, DSC3k2, [1024, True]]
  - [[-1, 9], 1, FullPAD_Tunnel, []] #-> Detect
  
  - [[-9, -5, -1], 1, Detect, [nc]] # Detect(P3, P4, P5)
