nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov13n.yaml' will call yolov13.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # Nano
  s: [0.50, 0.50, 1024]   # Small
  l: [1.00, 1.00, 512]    # Large
  x: [1.00, 1.50, 512]    # Extra Large

backbone: #input: N*3*640*640
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0 (P1/2)
  - [-1, 1, GhostModuleV3, [128, 3, 2]] # (P2/4)
  - [-1, 2, GhostBottleneckV3, [256, 1024]]
  - [-1, 1, GhostModuleV3, [256, 3, 2]] # (P3/8)
  - [-1, 2, GhostBottleneckV3, [512, 2048]]
  - [-1, 1, GhostModuleV3, [512, 3, 2]] # (P4/16)
  - [-1, 4, GhostBottleneckV3, [512, 2048]]
  - [-1, 1, GhostModuleV3, [1024, 3, 2]] # (P5/32)
  - [-1, 4, GhostBottleneckV3, [1024, 4096]]

head:
  - [[-5, -3, -1], 2, HyperACE, [512, 8, True, True, 0.5, 1, "both"]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [-2, 1, DownsampleConv, []]

  - [[6, -3], 1, FullPAD_Tunnel, []]
  - [[4, -3], 1, FullPAD_Tunnel, []]
  - [[8, -3], 1, FullPAD_Tunnel, []]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 12], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, DSC3k2, [512, True]]
  - [[-1, 9], 1, FullPAD_Tunnel, []]

  - [-2, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 13], 1, Concat, [1]] #cat backbone P3
  - [-1, 2, DSC3k2, [256, True]]
  - [10, 1, Conv, [256, 1, 1]]
  - [[-2, -1], 1, FullPAD_Tunnel, []] # -> Detect

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 18], 1, Concat, [1]] # cat head P4
  - [-1, 2, DSC3k2, [512, True]]
  - [[-1, 9], 1, FullPAD_Tunnel, []] # -> Detect

  - [-2, 1, Conv, [512, 3, 2]]
  - [[-1, 14], 1, Concat, [1]] # cat head P5
  - [-1, 2, DSC3k2, [1024, True]] # (P5/32-large)
  - [[-1, 11], 1, FullPAD_Tunnel, []] # -> Detect

  - [[-9, -5, -1], 1, Detect, [nc]] # Detect(P3, P4, P5)
