nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov13n.yaml' will call yolov13.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # Nano
  s: [0.50, 0.50, 1024]   # Small <- use this
  l: [1.00, 1.00, 512]    # Large
  x: [1.00, 1.50, 512]    # Extra Large

backbone: #v13 -> v3
  # [from, repeats, module, args]
  - [-1, 1, Conv, [32, 3, 1]]
  - [-1, 1, Conv, [64, 3, 2]] # (P1/2)
  - [-1, 1, Bottleneck, [64]] #
  - [-1, 1, Conv, [128, 3, 2]] # (P2/4)
  - [-1, 2, Bottleneck, [128]]
  - [-1, 1, Conv, [256, 3, 2]] # (P3/8)
  - [-1, 8, Bottleneck, [256]]
  - [-1, 1, Conv, [512, 1, 1]] # (P3/8, 512ch)
  - [-1, 1, DSConv, [512, 3, 2]] # (P4/16)
  - [-1, 8, DSC3k2, [512, True]]
  - [-1, 1, DSConv, [1024, 3, 2]] # (P5/32)
  - [-1, 4, LSKblock, [1024]]

head:
  - [[7, 9, 11], 2, HyperACE, [512, 8, True, True, 0.5, 1, "both"]]
  - [-1, 1, MEUM, []]
  - [12, 1, DownsampleConv, []]

  - [[9, 12], 1, FullPAD_Tunnel, []]
  - [[7, 13], 1, FullPAD_Tunnel, []]
  - [[11, 14], 1, FullPAD_Tunnel, []]

  - [-1, 1, MEUM, []]
  - [[-1, 15], 1, Concat, [1]] #  (cat backbone P4)
  - [-1, 2, Bottleneck, [512, True]]
  - [[-1, 12], 1, FullPAD_Tunnel, []]

  - [20, 1, MEUM, []]
  - [[-1, 16], 1, Concat, [1]] #  (cat backbone P3)
  - [-1, 2, Bottleneck, [256, True]]
  - [13, 1, Conv, [256, 1, 1]]
  - [[24, 25], 1, FullPAD_Tunnel, []] #  (P3/8-small detect output)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 21], 1, Concat, [1]] #  (cat head P4)
  - [-1, 2, Bottleneck, [512, True]]
  - [[-1, 12], 1, FullPAD_Tunnel, []] #  (P4/16-medium detect output)

  - [29, 1, Conv, [512, 3, 2]]
  - [[-1, 17], 1, Concat, [1]] #  (cat head P5)
  - [-1, 2, DSC3k2, [1024, True, 0.25]]
  - [[-1, 14], 1, FullPAD_Tunnel, []] #  (P5/32-large detect output)

  # Detect(P3, P4, P5)
  - [[26, 30, 34], 1, Detect, [nc]]
