# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv3 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov3
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # Nano
  s: [0.50, 0.50, 1024]   # Small
  l: [1.00, 1.00, 512]    # Large
  x: [1.00, 1.50, 512]    # Extra Large

# darknet53 backbone
backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [32, 3, 1]] # 0
  - [-1, 1, Conv, [64, 3, 2]] # 1-P1/2
  - [-1, 1, Bottleneck, [64]] # 2, 64:c2
  - [-1, 1, Conv, [128, 3, 2]] # 3-P2/4
  - [-1, 2, Bottleneck, [128]] # 4
  - [-1, 1, Conv, [256, 3, 2]] # 5-P3/8
  - [-1, 8, Bottleneck, [256]] # 6
  - [-1, 1, DSConv, [512, 3, 2]] # 7-P4/16
  - [-1, 8, DSC3k2, [512]] # 8
  - [-1, 1, DSConv, [1024, 3, 2]] # 9-P5/32
  - [-1, 4, DSC3k2, [1024]] # 10

# YOLOv3 head
head:
  - [-1, 1, DSC3k2, [1024, False]] #11
  - [-1, 1, DSConv, [512, 1, 1]] # 12
  - [-1, 1, DSConv, [1024, 3, 1]] # 13
  - [-1, 1, DSConv, [512, 1, 1]] # 14
  - [-1, 1, DSConv, [1024, 3, 1]] # 15 (P5/32-large)

  - [-2, 1, Conv, [256, 1, 1]] # 16
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17
  - [[-1, 8], 1, Concat, [1]] # 18, cat backbone P4
  - [-1, 1, DSC3k2, [512, False]] # 19
  - [-1, 1, DSC3k2, [512, False]] # 20
  - [-1, 1, Conv, [256, 1, 1]] # 21
  - [-1, 1, DSConv, [512, 3, 1]] # 22 (P4/16-medium)

  - [-2, 1, Conv, [128, 1, 1]] # 23
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 24
  - [[-1, 6], 1, Concat, [1]] # 25, cat backbone P3
  - [-1, 1, DSC3k2, [256, False]] # 26
  - [-1, 2, DSC3k2, [256, False]] # 27 (P3/8-small)

  - [[27, 22, 15], 1, Detect, [nc]] # Detect(P3, P4, P5)

#Conv args: ex.[32, 3, 1]->(c1), c2, kernal_size, stride
#->c1:auto from input, 32:c2, 3:kernal size, 1:stride
#stride=1 => output_size=input_size
#stride=2 => output_size=input_size/2